/*
23. Спроектувати АТД "Дек на базі кільцевого масиву" для контейнера, що міс-
тить дані довільного типу. Інтерфейс АТД включає такі обов'язкові операції:
- перевірка дека на пустоту.
- очищення дека,
- видалення елемента із дека,
- включення нового елемента у дек,
- ітератор для доступу до елементів дека з операціями:
1) встановлення на початок дека,
2) встановлення в кінець дека,
4) перехід до попереднього елемента дека,
4) перехід до наступного елемента дека.
*/


#include "func.hpp"


int main()
{
    mainMenu();
}
