/*
23. Розробити клас "Файл" для представлення бінарного файлу, що містить цілі
числа, серед яких можуть бути і від’ємні. Створити два бінарні файли (об’єкти
даного класу). На їх основі створити третій файл, в якому зберегти числа, які міс-
тяться в обох вхідних файлах, збільшивши їх у вказану кількість разів. При пере-
повненні зверху (overflow) або при переповненні знизу (underflow), згенерувати
відповідні виняткові ситуації і організувати їх обробку.
*/


#include "MainWindow.h"


int main(int argc, char *argv[]) {
    QApplication app(argc, argv);

    MainWindow mainWindow;
    mainWindow.show();

    return app.exec();
}