/*
Визначити клас "Дата" для роботи з датами в межах року. Членами класу є
число, місяць та рік. Реалізувати для нього декілька конструкторів, геттери, метод
визначення терміну, що залишився до кінця року. Перевантажити оператори:
префіксний "++" - для збільшення кількості місяців на 1, постфіксний "++" - для
збільшення кількості днів на 1; ">" - для порівняння дат. Створити три обʼєкта-
дати (D1, D2, D3), використовуючи різні конструктори. Збільшити дату D1 на 1
місяць, а дату D2 - на 1 день. Зʼясувати, яка із цих дат (D1 чи D2) більш пізня.
Для дати D3 визначити термін, що залишився до кінця року.
*/

#include "func.h"
#include "Date.h"


int main()
{
    int n;
    cout << "Бажаєте самостійно ввести дати (1) чи використовувати завчасно записані в програмі дати (2)? "; cin >> n;
    if (n == 1)
    {
        n1();
    }
    else if (n == 2)
    {
        n2();
    }
    else return 1;
}
