//Створити клас TDate, який містить трійку цілих чисел, що представляють
//число, місяць та рік, і методи порівнянь дат,заданих різними форматами,
//їх збільшення/зменшення на вказану величину. На основі цього класу створити
//класи-нащадки TDate1 та TDate2, що представляють дати в форматі «ЧЧ.ММ.РРРР»
//та «ММ-ЧЧ-РРРР» відповідно. Створити n об’єктів TDate1 та m обʼєктів TDate2.
//Визначити найпізнішу дату, а також дати, що належать заданому періоду дат.


#include "func.h"


int main() {

    mainMenu();

}
